from enum import Enum


class SadadEnum(Enum):
    status1 = "مطبوع"
    status2 = "منتهي الصلاحية"
    status3 = "تم السداد"
    status4 = "قيد السداد"  # رقم السداد وقيمة
    status5 = "مرفوض"  #
    status6 = "ملغى"
    status7 = "قيد الالغاء"


class SadadAnswers(Enum):
    ManualNoIssues = 'رخصة الموظف سارية لغاية ({{iqamehNo}}). واقامته سارية لغاية ({{iqamehValid}}) يرجى تجديد الاقامة للتوافق مع تاريخ انتهاء الرخصة الحالية، ثم يمكنكم تجديد الرخصة لفترة جديدة ،في حال مواجهة اشكالية اثناء تجديد الاقامة يرجى تزويدنا بصورة عن الخطأ الظاهر في منصة مقيم.'
    IqamehValidFor60Days = 'الموظف لديه اقامة سارية لغاية ({{iqamehExpDt}})، نفيدكم بأنه لا يمكن تجديد الرخصة في حال كانت الرخصة أو الإقامة سارية لاكثر من 180 يوم'
    IqamehAndWPEqualization = 'الموظف رقم ({{iqamehNumber}}) رخصة عمله غير سارية، ولكن اقامته سارية حتى ({{iqamehExpDt}}). نفيدكم بأنه لايمكن تجديد الرخصة في حال كانت الرخصة أو الاقامة سارية لاكثر من 180 يوم.\nملاحظة: سيتم الاعتماد على تاريخ انتهاء الاقامة الحالية عند تجديد الرخصة للمرة القادمة، وليس على تاريخ انتهاء الرخصة السابقة.\n ملاحظة: لا يتسبب الموظف في توقف الخدمات في حال كانت الاقامة سارية، حتى ولو كانت رخصته غير سارية.'
    SadadInfo = 'نفيدكم بأن رقم السداد {{sadadNumber}}, حالته "{{Status}}" '
    NoIndo = 'نفيدكم بأنه لا يوجد بيانات للرقم المدخل, يرجى التأكد الرقم المدخل'


class SadadLastStatus(Enum):
    Status1 = "مطبوع"
    Status2 = "ملغي لانتهاء الصلاحية"
    Status3 = "مدفوع"
    Status4 = "على قيد السداد"
    Status5 = "مرفوض"
    Status6 = "ملغي"
    Status7 = "قيد الالغاء"
    StatusNULL = "internal note : حالة السداد هي \"NULL\""


class IndebtAnswers(Enum):
    Answer_indebtedness_technical_issue_0 = 'internal note :( تحديث مديونية نقل عادي)\n \n مشكلة تقنية: قيمة المديونية صفر، يرجى رفع رقم الاقامة الى بورتال تمكين لتحديث البيانات'
    Answer_Iqama_Lass_than_88_days = 'حسب قواعد العمل في وزارة المواردالبشرية فأن المتأخرات تنتقل على شكل مديونية الى المنشأة القديمة في حال كانت الاقامة منتهية لاكثر من ثمانية وثمانين يوم عند النقل'
    Answer_no_transfer_request = 'internal note :( لا يوجد طلب نقل في قوى) \n\n لا يوجد للموظف طلب نقل في قواعد البيانات في منصة قوى، يرجى التحقق من طلبات النقل في قواعد البيانات في الوزارة'
    Answer_indebtedness_technical_issue_1 = 'internal note :( مديونية نقل عادي محدثة ولكن تظهر متاخرات)\n\nمشكلة تقنية: قيمة المديونية ليست صفر، يرجى التحقق من المقابل المالي الظاهر للعميل ,والتأكد من عدم احتساب النظام اي متأخرات اضافية وفي حال تم احتساب متأخرات اضافية يرجى رفع المشكلة الى بورتال تمكين  '
    Answer_transfer_requests_less_69 = 'حسب قواعد العمل في وزارة الموارد البشرية، قرار المديونية لا يشمل عمليات النقل التي تمت قبل (09-06-2022) حيث ان النقل للموظف تم بتاريخ ({{etdate}}).'
    Answer_transfer_requests_between_69_91_company = 'حسب قواعد العمل في وزارة الموارد البشرية، قرار المديونية لا يشمل عمليات النقل التي تمت قبل (01-09-2022) في حال كانت المنشاة المنقول منها الموظف من نوع شركة.'
    Answer_transfer_requests_between_69_91_org = 'internal note :(لا يوجد بيانات مديونية لموظف منقول قبل 1-9 من مؤسسة) \n\n الموظف منقول قبل (01-09-2023) من مؤسسة ولكن لا تظهر بيانات في جدول المديونية'
    Answer_transfer_requests_bigger_91 = 'internal note :(لا يوجد بيانات مديونية لموظف منقول بعد 1-9 ) \n\n الموظف منقول بعد (01-09-2023) ولكن لا تظهر بيانات في جدول المديونية'
    Absent_answer_for_new_est = 'حسب قواعد العمل في وزارة الموارد البشرية، في حال تم نقل موظف حالته متغيب عن العمل ستنتقل جميع متأخرات رخص العمل المستحقة على الموظف الى المنشأة الجديدة على شكل مديونية'
    Absent_answer_for_old_est = 'internal note :(وجود مديونية متغيب على المنشاة القديمة)\n \n مشكلة تقنية: يرجى التحقق من بيانات طلب النقل و المديونية ورفع المشكلة الى بورتال تمكين'
    WPCheckdetails = 'الموظف صاحب الهوية التالية : "{{IdNo}}" \n\n لديه رخصة عمل سارية الى تاريخ {{WorkPermitEndDate}}، ويمكنكم تجديد الرخصة لفترة جديدة '
    WPCheckdetailsF = ' \n الموظف صاحب الهوية رقم : "{{IdNo}}" لديه رخصة عمل منتهية من تاريخ {{WorkPermitEndDate}}، ويمكنكم تجديد الرخصة لفترة جديدة، وفي حال واجهتكم مشكلة يرجى تزويدنا بصورة عنها'
    WPIqamaValid = 'الموظف صاحب الهوية التالية : "{{IdNo}}" \n\n لا يمكن تجديد الرخصة لانه  لديه رخصة عمل او اقامة سارية لاكثر من 180 يوم حيث ان التاريخ انتهاء الرخصة: {{WorkPermitEndDate}} و تاريخ انتهاء الاقامة : "{{IqamaNumber}}"  '
    WPISSYNC = 'الموظف صاحب الهوية التالية : "{{IdNo}}" \n\n لديه رقم سداد مصدر وغير مدفوع'
    wpbiggerthaniqama = 'الموظف صاحب الهوية التالية : "{{IdNo}}" \n\nلديه رخصة سارية وغير مستخدمة في تجديد الاقامة، يمكنكم تجديد الاقامة الى تاريخ الرخصة الحالي'
    NoWp = 'الموظف صاحب الهوية التالية : "{{IdNo}}" \n\n ليس لديه رخصة عمل مصدرة'
